china-djyos/djyos/djysdk/djysrc/bsp/boarddrv/STM32756G-EVAL2/cpu_peri_lcd.c
//----------------------------------------------------
// Copyright (c) 2014, SHENZHEN PENGRUI SOFT CO LTD. All rights reserved.
// Redistribution and use in source and binary forms, with or without
// modification, are permitted provided that the following conditions are met:

// 1. Redistributions of source code must retain the above copyright notice,
//    this list of conditions and the following disclaimer.
// 2. Redistributions in binary form must reproduce the above copyright notice,
//    this list of conditions and the following disclaimer in the documentation
//    and/or other materials provided with the distribution.

// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
// AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
// IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
// ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
// LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
// CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
// INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
// CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
// POSSIBILITY OF SUCH DAMAGE.
//-----------------------------------------------------------------------------
// Copyright (c) 2014 著作权由深圳鹏瑞软件有限公司所有。著作权人保留一切权利。
//
// 这份授权条款，在使用者符合下列条件的情形下，授予使用者使用及再散播本
// 软件包装原始码及二进位可执行形式的权利，无论此包装是否经改作皆然：
//
// 1. 对于本软件源代码的再散播，必须保留上述的版权宣告、本条件列表，以
//    及下述的免责声明。
// 2. 对于本套件二进位可执行形式的再散播，必须连带以文件以及／或者其他附
//    于散播包装中的媒介方式，重制上述之版权宣告、本条件列表，以及下述
//    的免责声明。

// 免责声明：本软件是本软件版权持有人以及贡献者以现状（"as is"）提供，
// 本软件包装不负任何明示或默示之担保责任，包括但不限于就适售性以及特定目
// 的的适用性为默示性担保。版权持有人及本软件之贡献者，无论任何条件、
// 无论成因或任何责任主义、无论此责任为因合约关系、无过失责任主义或因非违
// 约之侵权（包括过失或其他原因等）而起，对于任何因使用本软件包装所产生的
// 任何直接性、间接性、偶发性、特殊性、惩罚性或任何结果的损害（包括但不限
// 于替代商品或劳务之购用、使用损失、资料损失、利益损失、业务中断等等），
// 不负任何责任，即在该种使用已获事前告知可能会造成此类损害的情形下亦然。
//-----------------------------------------------------------------------------
#include "cpu_peri.h"
#include "djyos.h"
#include "stdlib.h"
#include "stm32f7xx.h"
#include "stm32f7xx_hal_dma2d.h"
#include "stm32f7xx_hal_ltdc.h"
#include "stm32f7xx_hal_rcc_ex.h"
#include "cpu_peri_lcd.h"
#include "string.h"

#define lcd_swap(a, b){a^=b; b^=a; a^=b;}
typedef struct
{
    u16 hsw;            //水平同步宽度
    u16 vsw;            //垂直同步宽度
    u16 hbp;            //水平后廊
    u16 vbp;            //垂直后廊
    u16 hfp;            //水平前廊
    u16 vfp;            //垂直前廊
    u16 * pFrameBuffe;  //当前层缓冲区指针
    u32 pixsize;        //每个像素所占字节数
}_ltdc_dev;

static _ltdc_dev lcdltdc;                      //管理LCD LTDC的重要参数
static LTDC_HandleTypeDef  LTDC_Handler;       //LTDC句柄
static u16 *pLTDCBufferFG1 =NULL;//缓冲区起始位置
static u16 *pLTDCBufferFG2 =NULL;//缓冲区起始位置
static struct DisplayRsc lcd_display;
static struct MutexLCB Dma2dMutex;//Dma2D互斥访问。


#define PIXSIZE  2    //每个像素占2个字节
#define CN_LCD_PIXEL_FORMAT     CN_SYS_PF_RGB565  //系统颜色格式定义
#define CN_DMA2D_PIXEL_FORMAT  DMA2D_OUTPUT_RGB565//固件库颜色额格式定义

#define DMA2D_timeout   50000


static  void __lcd_backlight_onoff(u8 onoff)
{
  if(onoff)
      GPIO_SettoLow(GPIO_A,PIN8);
  else
      GPIO_SettoHigh(GPIO_A,PIN8);

}
//----------------------------------------------------------------
//功能: 开关LTDC
//参数:0/1
//----------------------------------------------------------------------------
void LTDC_Switch(u8 sw)
{
    if(sw==1) __HAL_LTDC_ENABLE(&LTDC_Handler);
    else if(sw==0)__HAL_LTDC_DISABLE(&LTDC_Handler);
}
//----------------------------------------------------------------
//功能: 开关指定层Layer
//参数:  层layer 0,第一层; 1,第二层
//      开关sw 1/0
//返回值:ture/false
//----------------------------------------------------------------------------
bool_t LTDC_Layer_Switch(u8 layerx,u8 sw)
{
    if(sw==1) __HAL_LTDC_LAYER_ENABLE(&LTDC_Handler,layerx);
    else if(sw==0) __HAL_LTDC_LAYER_DISABLE(&LTDC_Handler,layerx);
    __HAL_LTDC_RELOAD_CONFIG(&LTDC_Handler);
    return true;
}
//----------------------------------------------------------------
//功能: LTDC时钟设置。
//参数: pllsaidivr:LCD时钟分频系数,取值范围:0~3,对应分频2^(pllsaidivr+1)
//返回值:0,成功;1,失败。
//备注:CLK=(pllsain/pllsair)/(2^pllsaidivr)
//----------------------------------------------------------------------------
static bool_t LTDC_Clk_Set(u32 pllsain,u32 pllsair,u32 pllsaidivr)
{
    RCC_PeriphCLKInitTypeDef PeriphClkIniture;

    //LTDC输出像素时钟，需要根据自己所使用的LCD数据手册来配置！
    PeriphClkIniture.PeriphClockSelection=RCC_PERIPHCLK_LTDC;   //LTDC时钟
    PeriphClkIniture.PLLSAI.PLLSAIN=pllsain;
    PeriphClkIniture.PLLSAI.PLLSAIR=pllsair;
    PeriphClkIniture.PLLSAIDivR=pllsaidivr;
    if(HAL_RCCEx_PeriphCLKConfig(&PeriphClkIniture)==HAL_OK) //配置像素时钟，这里配置为时钟为18.75MHZ
    {
        return 0;   //成功
    }
    else return 1;  //失败
}

//----初始化lcd硬件------------------------------------------------------------
//功能: 初始化lcd硬件。
//参数: 无
//返回: 无
//备注: 本函数是移植关键函数
//----------------------------------------------------------------------------
void HAL_LTDC_MspInit(LTDC_HandleTypeDef* hltdc)
{

    __HAL_RCC_LTDC_CLK_ENABLE();                //使能LTDC时钟
    GPIO_PowerOn(GPIO_A);//閼冲苯鍘滈幒褍鍩楀鏇″壖
    GPIO_PowerOn(GPIO_I);
    GPIO_PowerOn(GPIO_J);
    GPIO_PowerOn(GPIO_K);
    LTDC_Clk_Set(251,5,0);

    GPIO_CfgPinFunc(GPIO_A,PIN8,GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_50M,GPIO_PUPD_NONE);
    GPIO_CfgPinFunc(GPIO_I,
            PIN12|PIN13|PIN14|PIN15,
            GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_50M,GPIO_PUPD_NONE);
    GPIO_CfgPinFunc(GPIO_J,
            PIN0|PIN1|PIN2|PIN3|PIN4|PIN5|PIN6|PIN7|PIN8|PIN9|PIN10|PIN11|PIN12|PIN13|PIN14|PIN15,
            GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_50M,GPIO_PUPD_NONE);
    GPIO_CfgPinFunc(GPIO_K,
            PIN0|PIN1|PIN2|PIN3|PIN4|PIN5|PIN6|PIN7,
            GPIO_MODE_AF,GPIO_OTYPE_PP,GPIO_SPEED_50M,GPIO_PUPD_NONE);

    GPIO_AFSet(GPIO_I,
            PIN12|PIN13|PIN14|PIN15,AF14);
    GPIO_AFSet(GPIO_J,
            PIN0|PIN1|PIN2|PIN3|PIN4|PIN5|PIN6|PIN7|PIN8|PIN9|PIN10|PIN11|PIN12|PIN13|PIN14|PIN15
            ,AF14);
    GPIO_AFSet(GPIO_K,
            PIN0|PIN1|PIN2|PIN3|PIN4|PIN5|PIN6|PIN7,AF14);
}

