china-djyos/djyos/djysdk/djysrc/bsp/boarddrv/STM32756G-EVAL2/cpu_peri_lcd.c
static bool_t Dma2d_Init(void)
{
    __HAL_RCC_DMA2D_CLK_ENABLE();               //使能DMA2D时钟

    return true;
}

//LTDC,基本参数设置.
//注意:此函数,必须在LTDC_Layer_Window_Config之前设置.
//layerx:层值,0/1.
//bufaddr:层颜色帧缓存起始地址
//pixformat:颜色格式.0,ARGB8888;1,RGB888;2,RGB565;3,ARGB1555;4,ARGB4444;5,L8;6;AL44;7;AL88
//alpha:层颜色Alpha值,0,全透明;255,不透明
//alpha0:默认颜色Alpha值,0,全透明;255,不透明
//bfac1:混合系数1,4(100),恒定的Alpha;6(101),像素Alpha*恒定Alpha
//bfac2:混合系数2,5(101),恒定的Alpha;7(111),像素Alpha*恒定Alpha
//bkcolor:层默认颜色,32位,低24位有效,RGB888格式
//返回值:无
void LTDC_Layer_Parameter_Config(u8 layerx,u32 bufaddr,u8 pixformat,u8 alpha,u8 alpha0,u8 bfac1,u8 bfac2,u32 bkcolor)
{
    LTDC_LayerCfgTypeDef pLayerCfg;

    pLayerCfg.WindowX0=0;                       //窗口起始X坐标
    pLayerCfg.WindowY0=0;                       //窗口起始Y坐标
    pLayerCfg.WindowX1=CN_LCD_XSIZE;          //窗口终止X坐标
    pLayerCfg.WindowY1=CN_LCD_YSIZE;         //窗口终止Y坐标
    pLayerCfg.PixelFormat=pixformat;            //像素格式
    pLayerCfg.Alpha=alpha;                      //Alpha值设置，0~255,255为完全不透明
    pLayerCfg.Alpha0=alpha0;                    //默认Alpha值
    pLayerCfg.BlendingFactor1=(u32)bfac1<<8;    //设置层混合系数
    pLayerCfg.BlendingFactor2=(u32)bfac2<<8;    //设置层混合系数
    pLayerCfg.FBStartAdress=bufaddr;            //设置层颜色帧缓存起始地址
    pLayerCfg.ImageWidth=CN_LCD_XSIZE;        //设置颜色帧缓冲区的宽度
    pLayerCfg.ImageHeight=CN_LCD_YSIZE;      //设置颜色帧缓冲区的高度
    pLayerCfg.Backcolor.Red=(u8)(bkcolor&0X00FF0000)>>16;   //背景颜色红色部分
    pLayerCfg.Backcolor.Green=(u8)(bkcolor&0X0000FF00)>>8;  //背景颜色绿色部分
    pLayerCfg.Backcolor.Blue=(u8)bkcolor&0X000000FF;        //背景颜色蓝色部分
    HAL_LTDC_ConfigLayer(&LTDC_Handler,&pLayerCfg,layerx);   //设置所选中的层
}
//LTDC,层颜窗口设置,窗口以LCD面板坐标系为基准
//注意:此函数必须在LTDC_Layer_Parameter_Config之后再设置.
//layerx:层值,0/1.
//sx,sy:起始坐标
//width,height:宽度和高度
void LTDC_Layer_Window_Config(u8 layerx,u16 sx,u16 sy,u16 width,u16 height)
{
    HAL_LTDC_SetWindowPosition(&LTDC_Handler,sx,sy,layerx);  //设置窗口的位置
    HAL_LTDC_SetWindowSize(&LTDC_Handler,width,height,layerx);//设置窗口大小
}

//选择层
//layerx:层号;0,第一层;1,第二层;
bool_t LTDC_Select_Layer(u8 layerx)
{
    switch (layerx)
    {
        case 0:
            lcdltdc.pFrameBuffe=pLTDCBufferFG1;
            return true;
        case 1:
            lcdltdc.pFrameBuffe=pLTDCBufferFG2;
            return true;
        default:  return false;
    }
}

//LTDC填充矩形,DMA2D填充
//(sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex-sx+1)*(ey-sy+1)
//注意:sx,ex,不能大于lcddev.width-1;sy,ey,不能大于lcddev.height-1!!!
//color:要填充的颜色
bool_t LTDC_Color_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u32 color)
{
    u32 timeout=0;
    u32 addr;
    bool_t flag=true;
    u32 height,width;


    width=ex-sx;
    height=ey-sy;

    addr=((u32)lcdltdc.pFrameBuffe+lcdltdc.pixsize*(CN_LCD_XSIZE*sy+sx));
    if(false==Lock_MutexPend(&Dma2dMutex,DMA2D_timeout))
        return false;

    RCC->AHB1ENR|=1<<23;
    DMA2D->CR&=~(1<<0);
    DMA2D->CR=3<<16;
    DMA2D->OPFCCR=CN_DMA2D_PIXEL_FORMAT;
    DMA2D->OOR  = lcd_display.width-width;
    DMA2D->OMAR =  addr;
    DMA2D->NLR  = height|(width<<16);
    DMA2D->OCOLR=color;
    DMA2D->CR|=1<<0;
    while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
    {
        timeout++;
        if(timeout>0X1FFFFF)
            {
                break;  //超时退出
                flag=false;
            }
    }
    DMA2D->IFCR|=1<<1;              //清除传输完成标志
    Lock_MutexPost(&Dma2dMutex);
    return flag;
}
//在指定区域内填充指定颜色块,DMA2D填充
//此函数仅支持u16,RGB565格式的颜色数组填充.
//(sx,sy),(ex,ey):填充矩形对角坐标,区域大小为:(ex-sx+1)*(ey-sy+1)
//注意:sx,ex,不能大于lcddev.width-1;sy,ey,不能大于lcddev.height-1!!!
//color:要填充的颜色数组首地址
bool_t  LTDC_BitMap_Fill(u16 sx,u16 sy,u16 ex,u16 ey,u16 *src_addr)
{
    u32 timeout=0;
    u16 offline;
    u32 addr;
    bool_t flag=true;
    //坐标系转换
    offline=lcd_display.width-(ex-sx);
    addr=((u32)(lcdltdc.pFrameBuffe+PIXSIZE*(lcd_display.width*sy+sx)));

    if(false==Lock_MutexPend(&Dma2dMutex,DMA2D_timeout))
        return false;
    RCC->AHB1ENR|=1<<23;            //使能DM2D时钟
    DMA2D->CR=0<<16;                //存储器到存储器模式
    DMA2D->FGPFCCR=CN_DMA2D_PIXEL_FORMAT;   //设置颜色格式
    DMA2D->FGOR=0;                  //前景层行偏移为0
    DMA2D->OOR=offline;             //设置行偏移
    DMA2D->CR&=~(1<<0);             //先停止DMA2D
    DMA2D->FGMAR=(u32)src_addr;        //源地址
    DMA2D->OMAR=addr;               //输出存储器地址
    DMA2D->NLR=(ey-sy+1)|((ex-sx+1)<<16);   //设定行数寄存器
    DMA2D->CR|=1<<0;                //启动DMA2D
    while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
    {
        timeout++;
        if(timeout>0X1FFFFF)
        {
            flag=false;
            break;  //超时退出
        }
    }
    DMA2D->IFCR|=1<<1;              //清除传输完成标志
    Lock_MutexPost(&Dma2dMutex);
    return flag;
}


static void LTDC_Init(u16 *pFrameBufferFG)
{
    lcdltdc.hsw=30;                 //水平同步宽度
    lcdltdc.hbp=114;                //水平后廊
    lcdltdc.hfp=16;                //水平前廊
    lcdltdc.vsw=3;                  //垂直同步宽度
    lcdltdc.vbp=32;                 //垂直后廊
    lcdltdc.vfp=10;                 //垂直前廊
    LTDC_Clk_Set(360,2,RCC_PLLSAIDIVR_4);//设置像素时钟  45Mhz
    lcdltdc.pixsize=PIXSIZE;              //每个像素占2个字节
    LTDC_Handler.Instance=LTDC;
    LTDC_Handler.Init.HSPolarity=LTDC_HSPOLARITY_AL;         //水平同步极性
    LTDC_Handler.Init.VSPolarity=LTDC_VSPOLARITY_AL;         //垂直同步极性
    LTDC_Handler.Init.DEPolarity=LTDC_DEPOLARITY_AL;         //数据使能极性
    LTDC_Handler.Init.PCPolarity=LTDC_PCPOLARITY_IPC;        //像素时钟极性
    LTDC_Handler.Init.HorizontalSync=lcdltdc.hsw-1;          //水平同步宽度
    LTDC_Handler.Init.VerticalSync=lcdltdc.vsw-1;            //垂直同步宽度
    LTDC_Handler.Init.AccumulatedHBP=lcdltdc.hsw+lcdltdc.hbp-1; //水平同步后沿宽度
    LTDC_Handler.Init.AccumulatedVBP=lcdltdc.vsw+lcdltdc.vbp-1; //垂直同步后沿高度
    LTDC_Handler.Init.AccumulatedActiveW=lcdltdc.hsw+lcdltdc.hbp+lcd_display.width-1;//有效宽度
    LTDC_Handler.Init.AccumulatedActiveH=lcdltdc.vsw+lcdltdc.vbp+lcd_display.height-1;//有效高度
    LTDC_Handler.Init.TotalWidth=lcdltdc.hsw+lcdltdc.hbp+lcd_display.width+lcdltdc.hfp-1;//总宽度
    LTDC_Handler.Init.TotalHeigh=lcdltdc.vsw+lcdltdc.vbp+lcd_display.height+lcdltdc.vfp-1;//总高度
    LTDC_Handler.Init.Backcolor.Red=0;           //屏幕背景层红色部分
    LTDC_Handler.Init.Backcolor.Green=0;         //屏幕背景层绿色部分
    LTDC_Handler.Init.Backcolor.Blue=0;          //屏幕背景色蓝色部分
    LTDC_Handler.State = HAL_LTDC_STATE_RESET;
    HAL_LTDC_Init(&LTDC_Handler);

    //层配置
    LTDC_Layer_Parameter_Config(0,(u32)pFrameBufferFG,LTDC_PIXEL_FORMAT_RGB565,255,0,6,7,0X000000);//层参数配置
    LTDC_Layer_Window_Config(0,0,0,lcd_display.width,lcd_display.height);
    LTDC_Select_Layer(0);           //选择第1层
    __lcd_backlight_onoff(1);

