china-djyos/djyos/djysdk/djysrc/bsp/boarddrv/STM32756G-EVAL2/cpu_peri_lcd.c
}
//------------------------------------------------------------------
//功能: 背光开关
//参数: true/false
//返回:
//-----------------------------------------------------------------------------


//----控制显示器---------------------------------------------------------------
//功能: 这是由driver提供商编写的，用于设置显示器各种参数的函数，属于应用程序的
//      范畴，功能由设备厂商定义。
//参数: disp，显示器指针
//返回: true=成功，false=失败
//-----------------------------------------------------------------------------
bool_t __lcd_disp_ctrl(struct DisplayRsc *disp)
{
    return true;
}


//----位图中画像素-------------------------------------------------------------
//功能: 在位图中画一个像素，只有在bitmap的像素格式为cn_custom_pf时，才需要绘制。
//      如果显卡不打算支持自定义格式，本函数直接返回。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x、y，坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: 无
//-----------------------------------------------------------------------------
bool_t __lcd_set_pixel_bm(struct RectBitmap *bitmap,
                     s32 x,s32 y,u32 color,u32 r2_code)
{
    return false;
}
//----位图中画线---------------------------------------------------------------
//功能: 在位图中画一条直线，不绘制(x2,y2)点，只绘制在limit限定的区域内的部分。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
bool_t __lcd_line_bm(struct RectBitmap *bitmap,struct Rectangle *limit,
                        s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{
    return false;
}
//----位图中画线(含端点)-------------------------------------------------------
//功能: 在位图中画一条直线，只绘制在limit限定的区域内的部分。
//参数: bitmap，目标位图
//      limit，限制矩形，只绘制在该矩形内部的部分
//      x1、y1、x2、y2，起点终点坐标
//      color，绘图用的颜色，cn_sys_pf_e8r8g8b8格式
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=失败，无硬件加速或不支持按r2_code画线
//-----------------------------------------------------------------------------
bool_t __lcd_line_bm_ie(struct RectBitmap *bitmap,struct Rectangle *limit,
                        s32 x1,s32 y1,s32 x2,s32 y2,u32 color,u32 r2_code)
{
    return false;
}
//----位图中填充矩形-----------------------------------------------------------
//镜像显示器无须实现本函数,直接返回false即可
//参数:
// DstBitmap: 绘制的目标位图
// Target: 目标填充区域,渐变色填充时用它的坐标做计算颜色的起点和终点
// Focus: 实际填充区域,gkernel确保其在Target矩形内部
// Color0,Color1: Target左上角和右下角颜色值,如果不是渐变填充,Color1将被忽略,
//              像素格式是CN_SYS_PF_ERGB8888
//Mode: 填充模式,CN_FILLRECT_MODE_N族常数
//返回: true=成功绘制，false=失败
//-----------------------------------------------------------------------------
bool_t __lcd_fill_rect_bm(struct RectBitmap *dst_bitmap,
                          struct Rectangle *Target,
                          struct Rectangle *Focus,
                          u32 Color0,u32 Color1,u32 Mode)
{
    u16 pixel;
      u16 *dst;
      s32 height,width;
      u32 timeout;
      bool_t flag;
      if(Mode != CN_FILLRECT_MODE_N)
          return false;

      if(dst_bitmap->PixelFormat != CN_LCD_PIXEL_FORMAT)
          return false;

      pixel = GK_ConvertRGB24ToPF(CN_LCD_PIXEL_FORMAT,Color0);

      dst = (u16*)((u32)dst_bitmap->bm_bits
                        + Focus->top * dst_bitmap->linebytes);
      dst += Focus->left;
      width=Focus->right-Focus->left;
      height=Focus->top-Focus->bottom;
      if(false==Lock_MutexPend(&Dma2dMutex,DMA2D_timeout))
          return false;
      RCC->AHB1ENR|=1<<23;            //使能DM2D时钟
      DMA2D->CR&=~(1<<0);             //先停止DMA2D
      DMA2D->CR=3<<16;                //寄存器到存储器模式
      DMA2D->OPFCCR=CN_DMA2D_PIXEL_FORMAT;  //设置输出颜色格式
      DMA2D->OOR  = lcd_display.width-width;  //设置行偏移
      DMA2D->OMAR=(u32)dst;               //输出存储器地址
      DMA2D->NLR  = height|(width<<16);   //设定行数寄存器
      DMA2D->OCOLR=pixel;                //设定输出颜色寄存器
      DMA2D->CR|=1<<0;                //启动DMA2D
      timeout =0;
      while((DMA2D->ISR&(1<<1))==0)   //等待传输完成
      {
          timeout+=10;
          Djy_DelayUs(10);
          if(timeout>DMA2D_timeout)
          {
              flag=false;
               break;  //超时退出
          }
      }
      DMA2D->IFCR|=1<<1;              //清除传输完成标志
      bool_t Lock_MutexDelete(struct MutexLCB *mutex);
      return flag;
}
//--------------bitmap中位块传送-----------------------------------------------
//功能: 把一个位图中的一个矩形区域传送到另一个区域，两个位图的像素格式
//参数:  dst_bitmap，目标位图
//      dst_rect，目标矩形
//      src_bitmap，源位图
//      xsrc、ysrc，源位图中被传送的区域左上角坐标
//      pat，pattern指针
//      bitmsk，rop4操作需要的掩码
//      rop_code，三元光栅操作码
//      transparentcolor，透明色
//返回: true=成功,false=失败
//-----------------------------------------------------------------------------

bool_t __lcd_blt_bm_to_bm(struct RectBitmap *dst_bitmap,
						  struct Rectangle *DstRect,
						  struct RectBitmap *src_bitmap,
						  struct Rectangle *SrcRect,
						  struct RopGroup RopCode,u32 transparentcolor)
{
    u16 *src_offset;    //源位图点阵缓冲区可能不对齐!!!
    struct RopGroup Rop = { 0, 0, 0, CN_R2_COPYPEN, 0, 0, 0  };

    if((dst_bitmap->PixelFormat != CN_LCD_PIXEL_FORMAT)
             ||(src_bitmap->PixelFormat != CN_LCD_PIXEL_FORMAT)
             ||(memcmp(&RopCode, &Rop ,sizeof(struct RopGroup))!=0))
    {
        return false;
    }
    else
    {
        if((ptu32_t)src_bitmap->bm_bits & 1)    //源位图缓冲区非对齐模型
            return false;
        else
        {
            src_offset = (u16*)((ptu32_t)src_bitmap->bm_bits
                         + SrcRect->top * src_bitmap->linebytes);
            src_offset += SrcRect->left;
            LTDC_BitMap_Fill(DstRect->left,DstRect->top,DstRect->right-1,DstRect->bottom-1,src_offset);
        }
    }
    return true;
}

//----screen中画像素-----------------------------------------------------------
//功能: 在screen中画一个像素.
//参数: x、y，像素坐标
//      color，颜色
//      r2_code，二元光栅操作码
//返回: true=成功绘制，false=没有绘制，或无需绘制
//-----------------------------------------------------------------------------
bool_t __lcd_set_pixel_screen(s32 x,s32 y,u32 color,u32 rop2_code)
{

	u32 dest;
    u32 byteoffset;
    byteoffset = (y*CN_LCD_XSIZE + x);
    color = GK_ConvertRGB24ToPF(CN_LCD_PIXEL_FORMAT,color);
    dest = (u32)lcdltdc.pFrameBuffe[byteoffset];
    dest = GK_BlendRop2(dest,color,rop2_code);
    lcdltdc.pFrameBuffe[byteoffset] = (u16)color;
    return true;
}

